#pragma once
#include "Mario.h"

class Coin
{
private:
	Print _print;
	Mario _mario;

	bool collect;

	int coin[14][10] =
	{
		{20,20,12,12,12,12, 1, 1,20,20},
		{20,12,12,12,12,12,12, 1, 1,20},
		{20,12,12,12,12,12,12, 1, 1,20},
		{12,12,12, 5, 5,12,12,12, 1, 1},
		{12,12, 5,12,12, 1,12,12, 1, 1},
		{12,12, 5,12,12, 1,12,12, 1, 1},
		{12,12, 5,12,12, 1,12,12, 1, 1},
		{12,12, 5,12,12, 1,12,12, 1, 1},
		{12,12, 5,12,12, 1,12,12, 1, 1},
		{12,12, 5,12,12, 1,12,12, 1, 1},
		{12,12,12, 1, 1,12,12,12, 1, 1},
		{20,12,12,12,12,12,12, 1, 1,20},
		{20,12,12,12,12,12,12, 1, 1,20},
		{20,20,12,12,12,12, 1, 1,20,20},
	};

public:
	// 도트 출력
	void DrawCoin(short posx, short posy);
	// 파괴 체크 함수
	void CheckCollect(short posx, short posy);
	// 마리오 충돌 체크
	void CheckCoin(short posx, short posy);

	Coin();
	~Coin();
};

